20210926151212-computer_science.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-14 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Science</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='../roam/css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">Computer Science</h1>
<div id="outline-container-orge5599fd" class="outline-2">
<h2 id="orge5599fd"><a href="#orge5599fd">概要</a></h2>
<div class="outline-text-2" id="text-orge5599fd">
<p>
Computer Scienceは学問としての領域。
</p>
</div>
</div>
<div id="outline-container-orgd421443" class="outline-2">
<h2 id="orgd421443"><a href="#orgd421443">Memo</a></h2>
</div>
<div id="outline-container-org4a4e8ab" class="outline-2">
<h2 id="org4a4e8ab"><a href="#org4a4e8ab">Tasks</a></h2>
<div class="outline-text-2" id="text-org4a4e8ab">
</div>
<div id="outline-container-org0b2c3ef" class="outline-3">
<h3 id="org0b2c3ef"><a href="#org0b2c3ef"><span class="todo TODO">TODO</span> <a href="https://speakerdeck.com/kobatako/netutowakufalsekotowozhi-rutame-sohutouearutawo-zi-zuo-sitahua">ネットワークのことを知るため ソフトウェアルータを 自作した話 - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-org0b2c3ef">
<p>
自作するスライド。
</p>
</div>
</div>
<div id="outline-container-org12756d8" class="outline-3">
<h3 id="org12756d8"><a href="#org12756d8"><span class="todo TODO">TODO</span> <a href="https://www.slideshare.net/ichikaway/phperkaigi2019">ゼロから始めるファミコンエミュレータ生活 PHPerKaigi2019</a></a></h3>
<div class="outline-text-3" id="text-org12756d8">
<p>
エミュレータのスライド。
</p>
</div>
</div>
<div id="outline-container-orgdb96ed4" class="outline-3">
<h3 id="orgdb96ed4"><a href="#orgdb96ed4"><a href="https://keens.github.io/blog/2017/04/30/memoritosutakkutohi_puto/">メモリとスタックとヒープとプログラミング言語 | κeenのHappy Hacκing Blog</a></a></h3>
<div class="outline-text-3" id="text-orgdb96ed4">
<p>
スタックとヒープの解説記事。
</p>
</div>
</div>
<div id="outline-container-org04c7966" class="outline-3">
<h3 id="org04c7966"><a href="#org04c7966"><span class="todo TODO">TODO</span> <a href="https://zenn.dev/yukiyada/articles/23c9fde740744d">Nand2tetrisをGoで実装する ~ コンパイラ(コンパイラ・フロントエンド)編(10,11章) ~</a></a></h3>
<div class="outline-text-3" id="text-org04c7966">
<p>
やる。
</p>
</div>
</div>
<div id="outline-container-orgea371dc" class="outline-3">
<h3 id="orgea371dc"><a href="#orgea371dc"><span class="todo TODO">TODO</span> <a href="https://www.oreilly.co.jp/books/9784873116976/">O&rsquo;Reilly Japan - アンダースタンディング コンピュテーション</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-orgea371dc">
<p>
計算の仕組みを理解する本。
</p>
</div>
</div>
<div id="outline-container-org9148e6d" class="outline-3">
<h3 id="org9148e6d"><a href="#org9148e6d"><span class="todo TODO">TODO</span> <a href="https://drive.google.com/file/d/1Hdh-K3gyttzf-74j3B9EfOl_dScswHEF/view">ods-cpp.pdf - Google Drive</a></a></h3>
<div class="outline-text-3" id="text-org9148e6d">
<p>
無料のコンピュータサイエンスの教科書。
</p>
</div>
</div>
<div id="outline-container-org78dc887" class="outline-3">
<h3 id="org78dc887"><a href="#org78dc887"><span class="todo TODO">TODO</span> <a href="https://www.oreilly.co.jp/books/9784873117126/">O&rsquo;Reilly Japan - コンピュータシステムの理論と実装</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Read">Read</span></span></a></h3>
<div class="outline-text-3" id="text-org78dc887">
<p>
実装して理解する本。
</p>

<ul class="org-ul">
<li>97, 128, 171, 180, 185</li>
</ul>

<p>
メモ。
</p>

<ul class="org-ul">
<li>@value はAレジスタにvalueを格納することを示す
<ul class="org-ul">
<li>例. @17 はAレジスタに17を格納する</li>
</ul></li>
<li id="A命令">操作を行いたいアドレスを指定する命令</li>
<li id="C命令">計算命令</li>
<li>デバイスはメモリマップを通じて、ほかのメモリと全く同じようにCPUから扱うことができる
<ul class="org-ul">
<li>キーボードを押している間、メモリのどこかの値が変わっている</li>
</ul></li>
<li>アセンブラは、かんたんに作れた。単なるテキスト処理にすぎない</li>
<li>高水準プログラムは初めに中間コードに変換され、その中間コードは機械語に変換される
<ul class="org-ul">
<li>中間コードは実際のプラットフォームで実行される代わりに、バーチャルマシンで実行されるように設計されている</li>
</ul></li>
<li>1. 高水準コードからVM命令の中間コードへの変換を行う</li>
<li>2. VMコードから対象プラットフォームにおける機械語への変換を行う</li>
<li>スタックマシンという計算モデルにおいて、算術命令はスタックの一番上からオペランドを取り出し、その結果をスタックの一番上に置く。どのような算術命令や論理命令であっても、単純なスタックによるモデルを用いて、その命令のための評価器を実装することができる</li>
<li>Jackクラスファイル → (コンパイラ) → VMファイル → (VM変換器) → Hackアセンブリコード → (アセンブラ) → Hackバイナリコード</li>
<li>JVMはバイトコードと呼ばれる中間言語を実行するスタック型のバーチャルマシンである</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdad2f6b" class="outline-2">
<h2 id="orgdad2f6b"><a href="#orgdad2f6b">Words</a></h2>
<div class="outline-text-2" id="text-orgdad2f6b">
<dl class="org-dl">
<dt>インタフェース</dt><dd>そのデータ構造が何をするか表現する。データ構造がサポートしている操作一式と、セマンティクスを定義する</dd>
<dt>実装</dt><dd>そのデータ構造をどのようにやるかを表現する</dd>
<dt>セマンティクス</dt><dd>操作の意味</dd>
</dl>
</div>
</div>
<div id="outline-container-org5ed9f5f" class="outline-2">
<h2 id="org5ed9f5f"><a href="#org5ed9f5f">Reference</a></h2>
<div class="outline-text-2" id="text-org5ed9f5f">
</div>
<div id="outline-container-org258d890" class="outline-3">
<h3 id="org258d890"><a href="#org258d890"><a href="https://speakerdeck.com/dqneo/making-compilers-is-fun">コンパイラ作りの魅力を語る / Making compilers is fun - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-org258d890">
<p>
コンパイラ作りのスライド。
</p>
</div>
</div>
<div id="outline-container-org9fad3ef" class="outline-3">
<h3 id="org9fad3ef"><a href="#org9fad3ef"><a href="http://alvyray.com/Memos/CG/Microsoft/6_pixel.pdf">ピクセルは四角じゃない</a></a></h3>
<div class="outline-text-3" id="text-org9fad3ef">
<p>
ピクセルについての論文。
</p>
</div>
</div>
<div id="outline-container-org872cbe9" class="outline-3">
<h3 id="org872cbe9"><a href="#org872cbe9"><a href="https://simonschreibt.de/gat/renderhell/">Render Hell 2.0 | Simon schreibt.</a></a></h3>
<div class="outline-text-3" id="text-org872cbe9">
<p>
GPUの解説。
</p>
</div>
</div>
<div id="outline-container-orgfe93e02" class="outline-3">
<h3 id="orgfe93e02"><a href="#orgfe93e02"><a href="https://www.seshop.com/product/detail/24207">コンピュータアーキテクチャのエッセンス［第2版］【PDF版】 ｜ SEshop｜ 翔泳社の本・電子書籍通販サイト</a></a></h3>
<div class="outline-text-3" id="text-orgfe93e02">
<p>
低レイヤの本。
</p>
</div>
</div>
<div id="outline-container-orge502e74" class="outline-3">
<h3 id="orge502e74"><a href="#orge502e74"><a href="https://w.atwiki.jp/gbspec/pages/35.html">CPU/命令セット - GB Spec - atwiki（アットウィキ）</a></a></h3>
<div class="outline-text-3" id="text-orge502e74">
<p>
命令セットの一覧。
</p>
</div>
</div>
<div id="outline-container-orga2b1ac1" class="outline-3">
<h3 id="orga2b1ac1"><a href="#orga2b1ac1"><a href="https://www.oreilly.co.jp/books/9784873118819/">O&rsquo;Reilly Japan - Python計算機科学新教本</a></a></h3>
<div class="outline-text-3" id="text-orga2b1ac1">
<p>
計算機科学を動くコードで学ぶ本。
</p>
</div>
</div>
<div id="outline-container-org947884f" class="outline-3">
<h3 id="org947884f"><a href="#org947884f"><a href="https://www.memorymanagement.org/">Home — Memory Management Reference 4.0 documentation</a></a></h3>
<div class="outline-text-3" id="text-org947884f">
<p>
メモリ管理のリファレンス。
</p>
</div>
</div>
<div id="outline-container-orgf4d6045" class="outline-3">
<h3 id="orgf4d6045"><a href="#orgf4d6045"><a href="https://cs50.jp/">CS50 for Japanese: コンピュータサイエンスの入門 – 当ウェブサイトは、Creative Commons ライセンスに基づいて管理されています。</a></a></h3>
<div class="outline-text-3" id="text-orgf4d6045">
<p>
ハーバード大学のコンピュータサイエンス講座の日本語訳。
</p>
</div>
</div>
<div id="outline-container-orgb7153e2" class="outline-3">
<h3 id="orgb7153e2"><a href="#orgb7153e2"><a href="https://github.com/Developer-Y/cs-video-courses">Developer-Y/cs-video-courses: List of Computer Science courses with video lectures.</a></a></h3>
<div class="outline-text-3" id="text-orgb7153e2">
<p>
コンピュータ・サイエンスの動画集。
</p>
</div>
</div>
</div>
<div id="outline-container-org011ee1f" class="outline-2">
<h2 id="org011ee1f"><a href="#org011ee1f">Archives</a></h2>
<div class="outline-text-2" id="text-org011ee1f">
</div>
<div id="outline-container-orgf4f0522" class="outline-3">
<h3 id="orgf4f0522"><a href="#orgf4f0522"><span class="done DONE">DONE</span> <a href="https://speakerdeck.com/daikimiura/implement-jvm-with-ruby">RubyでJVMを実装してみる / Implement JVM with Ruby - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-orgf4f0522">
<p>
JVMを実装する。
</p>
</div>
</div>

<div id="outline-container-orgdab3d33" class="outline-3">
<h3 id="orgdab3d33"><a href="#orgdab3d33"><span class="done DONE">DONE</span> <a href="https://speakerdeck.com/memory1994/phperkaigi-2019">PHPerKaigi 2019 - PHP でJVMに入門する</a></a></h3>
<div class="outline-text-3" id="text-orgdab3d33">
<p>
VM実装の予備知識。
</p>

<p>
実装して理解できた。
</p>
</div>
</div>
<div id="outline-container-org12589cb" class="outline-3">
<h3 id="org12589cb"><a href="#org12589cb"><span class="done DONE">DONE</span> JVMを実装する</a></h3>
<div class="outline-text-3" id="text-org12589cb">
<ul class="org-ul">
<li>難しそうに見えるが、単にバイナリをパースしていく作業</li>
<li><a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>だと、binary.Readで構造体のフィールドのバイト数だけ読み進められる</li>
</ul>
</div>
</div>
<div id="outline-container-orgfecf6dc" class="outline-3">
<h3 id="orgfecf6dc"><a href="#orgfecf6dc"><span class="done DONE">DONE</span> <a href="https://speakerdeck.com/memory1994/php-de-jvm-woshi-zhuang-site-hello-world-wochu-li-surumade">PHP で JVM を実装して Hello World を出力するまで - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-orgfecf6dc">
<p>
実装の解説。
</p>

<ul class="org-ul">
<li>Constant Pool はコンパイル時に埋め込まれたクラスの情報や参照を保持しておくためのシンボルテーブル</li>
<li>実行の流れ
<ul class="org-ul">
<li>ClassFile Structureを読み込む</li>
<li>Constant Poolを読み込む</li>
<li>メソッドの情報を読み込む</li>
<li>Code Attributeを読み込む</li>
<li>オペコードを実行する</li>
</ul></li>
<li>オペランドスタック</li>
<li>JVMはレジスタへ書き込むのではなく、メモリ上に値を積む。積んだ値を命令がオペランドとしてポップして処理する</li>
<li><code>[オペコード][オペランド(オペコードによって長さが変わる)]</code> みたいな感じ</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org86e902f" class="outline-2">
<h2 id="org86e902f"><a href="#org86e902f">Backlinks</a></h2>
<div class="outline-text-2" id="text-org86e902f">
<ul class="org-ul">
<li><a href="./20210911183844-lisp.html">LISP</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
